import numpy as np

# 类别的伪彩色映射
VOC_COLORMAP = np.array([
    [0, 0, 0],  # 背景
    [128, 0, 0],  # 飞机
    [0, 128, 0],  # 自行车
    [128, 128, 0],  # 鸟
    [0, 0, 128],  # 船
    [128, 0, 128],  # 瓶子
    [0, 128, 128],  # 公车
    [128, 128, 128],  # 小车
    [64, 0, 0],  # 猫
    [192, 0, 0],  # 椅子
    [64, 128, 0],  # 牛
    [192, 128, 0],  # 餐桌
    [64, 0, 128],  # 狗
    [192, 0, 128],  # 马
    [64, 128, 128],  # 摩托车
    [192, 128, 128],  # 人
    [0, 64, 0],  # 花盆
    [128, 64, 0],  # 绵羊
    [0, 192, 0],  # 沙发
    [128, 192, 0],  # 火车
    [0, 64, 128],  # 电视/显示器
    [224, 224, 192]  # 边界(255)
], dtype=np.uint8)


def voc_colorize(mask):
    """根据类别的索引，将灰度图mask转换为彩色图"""
    mask[mask == 255] = 21
    color_mask = VOC_COLORMAP[mask]
    return color_mask
